tutorials/pimpleHFDIBFoam/Immersed_IB_Valves_in_Cube/Immersed-IB-Saddle-Valves-Mesh200k/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|  3D graded rectangular box for MV + AV valve motion                         |
|  Fine mesh around valve opening/closing region                              |
|  Coarser mesh away from valves                                              |
|  Same patch names retained: left, right, up, down, frontAndBack             |
|  Total cells = 212800                                                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    // z = 0.095
    (-0.060 -0.015 0.095)  // 0
    (-0.040 -0.015 0.095)  // 1
    ( 0.030 -0.015 0.095)  // 2
    ( 0.050 -0.015 0.095)  // 3

    (-0.060 -0.005 0.095)  // 4
    (-0.040 -0.005 0.095)  // 5
    ( 0.030 -0.005 0.095)  // 6
    ( 0.050 -0.005 0.095)  // 7

    (-0.060  0.045 0.095)  // 8
    (-0.040  0.045 0.095)  // 9
    ( 0.030  0.045 0.095)  // 10
    ( 0.050  0.045 0.095)  // 11

    (-0.060  0.055 0.095)  // 12
    (-0.040  0.055 0.095)  // 13
    ( 0.030  0.055 0.095)  // 14
    ( 0.050  0.055 0.095)  // 15

    // z = 0.102
    (-0.060 -0.015 0.102)  // 16
    (-0.040 -0.015 0.102)  // 17
    ( 0.030 -0.015 0.102)  // 18
    ( 0.050 -0.015 0.102)  // 19

    (-0.060 -0.005 0.102)  // 20
    (-0.040 -0.005 0.102)  // 21
    ( 0.030 -0.005 0.102)  // 22
    ( 0.050 -0.005 0.102)  // 23

    (-0.060  0.045 0.102)  // 24
    (-0.040  0.045 0.102)  // 25
    ( 0.030  0.045 0.102)  // 26
    ( 0.050  0.045 0.102)  // 27

    (-0.060  0.055 0.102)  // 28
    (-0.040  0.055 0.102)  // 29
    ( 0.030  0.055 0.102)  // 30
    ( 0.050  0.055 0.102)  // 31

    // z = 0.151
    (-0.060 -0.015 0.151)  // 32
    (-0.040 -0.015 0.151)  // 33
    ( 0.030 -0.015 0.151)  // 34
    ( 0.050 -0.015 0.151)  // 35

    (-0.060 -0.005 0.151)  // 36
    (-0.040 -0.005 0.151)  // 37
    ( 0.030 -0.005 0.151)  // 38
    ( 0.050 -0.005 0.151)  // 39

    (-0.060  0.045 0.151)  // 40
    (-0.040  0.045 0.151)  // 41
    ( 0.030  0.045 0.151)  // 42
    ( 0.050  0.045 0.151)  // 43

    (-0.060  0.055 0.151)  // 44
    (-0.040  0.055 0.151)  // 45
    ( 0.030  0.055 0.151)  // 46
    ( 0.050  0.055 0.151)  // 47

    // z = 0.158
    (-0.060 -0.015 0.158)  // 48
    (-0.040 -0.015 0.158)  // 49
    ( 0.030 -0.015 0.158)  // 50
    ( 0.050 -0.015 0.158)  // 51

    (-0.060 -0.005 0.158)  // 52
    (-0.040 -0.005 0.158)  // 53
    ( 0.030 -0.005 0.158)  // 54
    ( 0.050 -0.005 0.158)  // 55

    (-0.060  0.045 0.158)  // 56
    (-0.040  0.045 0.158)  // 57
    ( 0.030  0.045 0.158)  // 58
    ( 0.050  0.045 0.158)  // 59

    (-0.060  0.055 0.158)  // 60
    (-0.040  0.055 0.158)  // 61
    ( 0.030  0.055 0.158)  // 62
    ( 0.050  0.055 0.158)  // 63
);

blocks
(
    // bottom z layer: z0 -> z1
    hex (0 1 5 4 16 17 21 20)     (12 8 8)    simpleGrading (0.35 0.35 0.35)
    hex (1 2 6 5 17 18 22 21)     (52 8 8)    simpleGrading (1    0.35 0.35)
    hex (2 3 7 6 18 19 23 22)     (12 8 8)    simpleGrading (2.857 0.35 0.35)

    hex (4 5 9 8 20 21 25 24)     (12 40 8)   simpleGrading (0.35 1    0.35)
    hex (5 6 10 9 21 22 26 25)    (52 40 8)   simpleGrading (1    1    0.35)
    hex (6 7 11 10 22 23 27 26)   (12 40 8)   simpleGrading (2.857 1   0.35)

    hex (8 9 13 12 24 25 29 28)   (12 8 8)    simpleGrading (0.35 2.857 0.35)
    hex (9 10 14 13 25 26 30 29)  (52 8 8)    simpleGrading (1    2.857 0.35)
    hex (10 11 15 14 26 27 31 30) (12 8 8)    simpleGrading (2.857 2.857 0.35)

    // middle z layer: z1 -> z2
    hex (16 17 21 20 32 33 37 36)   (12 8 34)   simpleGrading (0.35 0.35 1)
    hex (17 18 22 21 33 34 38 37)   (52 8 34)   simpleGrading (1    0.35 1)
    hex (18 19 23 22 34 35 39 38)   (12 8 34)   simpleGrading (2.857 0.35 1)

    hex (20 21 25 24 36 37 41 40)   (12 40 34)  simpleGrading (0.35 1 1)
    hex (21 22 26 25 37 38 42 41)   (52 40 34)  simpleGrading (1    1 1)
    hex (22 23 27 26 38 39 43 42)   (12 40 34)  simpleGrading (2.857 1 1)

    hex (24 25 29 28 40 41 45 44)   (12 8 34)   simpleGrading (0.35 2.857 1)
    hex (25 26 30 29 41 42 46 45)   (52 8 34)   simpleGrading (1    2.857 1)
    hex (26 27 31 30 42 43 47 46)   (12 8 34)   simpleGrading (2.857 2.857 1)

    // top z layer: z2 -> z3
    hex (32 33 37 36 48 49 53 52)   (12 8 8)    simpleGrading (0.35 0.35 2.857)
    hex (33 34 38 37 49 50 54 53)   (52 8 8)    simpleGrading (1    0.35 2.857)
    hex (34 35 39 38 50 51 55 54)   (12 8 8)    simpleGrading (2.857 0.35 2.857)

    hex (36 37 41 40 52 53 57 56)   (12 40 8)   simpleGrading (0.35 1    2.857)
    hex (37 38 42 41 53 54 58 57)   (52 40 8)   simpleGrading (1    1    2.857)
    hex (38 39 43 42 54 55 59 58)   (12 40 8)   simpleGrading (2.857 1   2.857)

    hex (40 41 45 44 56 57 61 60)   (12 8 8)    simpleGrading (0.35 2.857 2.857)
    hex (41 42 46 45 57 58 62 61)   (52 8 8)    simpleGrading (1    2.857 2.857)
    hex (42 43 47 46 58 59 63 62)   (12 8 8)    simpleGrading (2.857 2.857 2.857)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 20 16)
            (4 8 24 20)
            (8 12 28 24)

            (16 20 36 32)
            (20 24 40 36)
            (24 28 44 40)

            (32 36 52 48)
            (36 40 56 52)
            (40 44 60 56)
        );
    }

    right
    {
        type patch;
        faces
        (
            (3 19 23 7)
            (7 23 27 11)
            (11 27 31 15)

            (19 35 39 23)
            (23 39 43 27)
            (27 43 47 31)

            (35 51 55 39)
            (39 55 59 43)
            (43 59 63 47)
        );
    }

    up
    {
        type patch;
        faces
        (
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)

            (28 29 45 44)
            (29 30 46 45)
            (30 31 47 46)

            (44 45 61 60)
            (45 46 62 61)
            (46 47 63 62)
        );
    }

    down
    {
        type patch;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)

            (16 32 33 17)
            (17 33 34 18)
            (18 34 35 19)

            (32 48 49 33)
            (33 49 50 34)
            (34 50 51 35)
        );
    }

    frontAndBack
    {
        type patch;
        faces
        (
            // z = zMin
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (4 5 9 8)
            (5 6 10 9)
            (6 7 11 10)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)

            // z = zMax
            (48 49 53 52)
            (49 50 54 53)
            (50 51 55 54)
            (52 53 57 56)
            (53 54 58 57)
            (54 55 59 58)
            (56 57 61 60)
            (57 58 62 61)
            (58 59 63 62)
        );
    }
);

mergePatchPairs();
