tutorials/pimpleHFDIBFoam/Immersed_IB_Valves_in_Cube/Immersed-IB-Saddle-Valves-Mesh200k/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  8
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}

// --------------------------- Global settings --------------------------------

bodyNames ("MV_Valve_Final" "AV_Valve_Final");

surfaceThreshold        1e-4;
stepDEM                 0.05;
geometricD              (1 1 1);
recordSimulation        true;
recordFirstTimeStep     false;
nSolidsInDomain         1000;
ibCouplingCoeff         0.05;

outputSetup
{
    basic        true;
    iB           false;
    DEM          false;
    addModel     true;
    parallelDEM  false;
    writeIBPoints true;
}

virtualMesh
{
    level        2;
    charCellSize 0.0012;
}

// interpolationSchemes
// {
//     method  line;
//     U       cellPoint;
// }

interpolationSchemes
{
    method leastSquares;

    leastSquaresCoeffs
    {
        distFactor    1.0;
        radiusFactor  6.0;
        angleFactor   120.0;
        maxCCRows     25;
    }
}

// ------------------------------- DEM ----------------------------------------

DEM
{
    LcCoeff       4.0;
    rotationModel chen2012;

    materials
    {
        particle
        {
            Y     1e7;
            nu    0.3;
            mu    0.05;
            adhN  0;
            eps   0.5;
        }

        wall
        {
            Y     1e7;
            nu    0.2;
            mu    0;
            adhN  0;
            eps   0.5;
        }
    }

    // Mesh bounding box (from checkMesh):
    // (-0.00314206 -0.0619276 -0.0411181) (0.0472645 0.038652 0.00541275)
    // Using ε = 0.0005 → planes slightly inside the CFD box
    collisionPatches
    {
        wallXp
        {
            material   wall;
            nVec       (-1 0 0);
            planePoint ( 0.0467645 0 0 );
        }
        wallXm
        {
            material   wall;
            nVec       ( 1 0 0);
            planePoint (-0.00264206 0 0 );
        }
        wallYp
        {
            material   wall;
            nVec       (0 -1 0);
            planePoint (0  0.038152 0);
        }
        wallYm
        {
            material   wall;
            nVec       (0  1 0);
            planePoint (0 -0.0614276 0);
        }
        wallZp
        {
            material   wall;
            nVec       (0 0 -1);
            planePoint (0 0  0.00491275);
        }
        wallZm
        {
            material   wall;
            nVec       (0 0  1);
            planePoint (0 0 -0.0406181);
        }
    }
}

// ============================= MITRAL BODY ==================================

MV_Valve_Final
{
    rho   rho [1 -3 0 0 0 0 0] 5000;

    U { BC noSlip; }

    material        particle;

    // STL-based geometry
    // STL Bounding Box (surfaceCheck):
    // (0.0241721 0.00125323 -0.0333112) (0.0430165 0.0194722 -0.00493661)
    bodyGeom        stlBased;
    stlBasedCoeffs
    {
        fileName "constant/triSurface/MV_Valve_Final.stl";
        // scale 1.0; translate (0 0 0); rotate (axis (0 0 1) angle 0);
    }

    sdBasedLambda   false;
    interfaceSpan   1.0;
    startSynced     false;
    refineBuffers   2;
    timesToSetStatic -1;

    // -------- Prescribed valve motion (MITRAL, geodesic-ξ axis) --------
    deformingBody_mitral_ref
    {
        // IMPORTANT: bottomCenter = annulus → fixedEnd must be bottom
        fixedEnd  bottom;   // CHANGED from "top" to "bottom"

        period    1;
        timeLaw   twoWindow;

        // Your shifted timings (keep as-is unless you want to retune)
        // original
	//closeWindow (0.615 0.645);
	//openWindow (0.950 1.000);
	//closeWindow (0.005 0.01);
	 closeWindow (0.03 0.07);
        openWindow  (0.12 0.17);

        Fmax          1;
        nearRamp      0.010;   // [m] ramp from attachment into leaflet
        activeLen     0.0145;   // [m] full-activity depth (≈ extrusion length)
        spaceLaw      smootherstep;
        leafThickness 0.001;
        flipNormalTowardValve true;

        // Axis endpoints (Cb = annulus, Ct = free edge)
        // Cb (ξ = 0, fixed ring)
        bottomCenter (0.00278581 0.01120448 0.12730459);
        // Ct (ξ > 0, free edge, collapses)
        topCenter    (-0.00293333 -0.00122377 0.12433304);

        // Per-vertex geodesic distances (ξ ≥ 0 from annulus to free edge)
        xiFieldFile "constant/triSurface/MV_Valve_Final_xi_geodesic.dat";

	 // NEW: explicit annulus lock for MV
        annulusStlFile "constant/triSurface/Mitral_annulus.stl";
        // start with something like leafThickness/2; adjust if needed
        annulusTol 2.5e-4;   // [m] = 1 mm, tune if too strict/loose

	mitralRefVelocityMode ibpointsonly; //off
    }

    // Required by your code path (no-op: adds nothing)
    bodyAddition
    {
        addModel           once;
        distributionCoeffs
        {
            addMode         boundBox;
            stlBaseSize     1e-5;
            addDomain       boundBox;
            boundBoxCoeffs
            {
                minBound (0 0 0);
                maxBound (0 0 0);
            }
        }
    }
}

// ============================= AORTIC BODY ==================================

AV_Valve_Final
{
    rho   rho [1 -3 0 0 0 0 0] 5000;

    U { BC noSlip; }

    material        particle;

    // STL-based geometry
    // STL Bounding Box (surfaceCheck):
    // (0.00175082 0.0115397 -0.0280971) (0.0209459 0.0307861 -0.00941113)
    bodyGeom        stlBased;
    stlBasedCoeffs
    {
        fileName "constant/triSurface/AV_Valve_Final.stl";
    }

    sdBasedLambda   false;
    interfaceSpan   1.0;
    startSynced     false;
    refineBuffers   2;
    timesToSetStatic -1;

    // -------- Prescribed valve motion (AORTIC, geodesic-ξ axis) --------
    deformingBody_mitral_ref   // keep this name if C++ expects it
    {
        // bottomCenter = annulus → fixed side
        fixedEnd  bottom;

        period    1;
        timeLaw   threeWindow;

        // Your shifted timings
        // original: openWindow (0.645 0.675); close2Window (0.950 1.000);
	close1Window (0.000 0.010);
	//close1Window (0.000 0.005);
	//openWindow (0.645 0.675);
	//close2Window (0.950 1.000);
	 openWindow   (0.07 0.10);
        close2Window (0.12 0.17);

        Fmax          1;
        nearRamp      0.010;
        activeLen     0.0145;
        spaceLaw      smootherstep;
        leafThickness 0.001;
        flipNormalTowardValve false;

        // Axis endpoints (Cb = annulus, Ct = free edge)
        bottomCenter (-0.01632726 0.01930645 0.12016223);  // Cb, annulus
        topCenter    (-0.02507337 0.03023325 0.11982983);  // Ct, free edge

        // Per-vertex geodesic distances (ξ ≥ 0 from annulus)
        xiFieldFile "constant/triSurface/AV_Valve_Final_xi_geodesic.dat";

	// NEW: explicit annulus lock for MV
        annulusStlFile "constant/triSurface/Aortic_annulus.stl";
        // start with something like leafThickness/2; adjust if needed
        annulusTol 1.5e-4;   // [m] = 1 mm, tune if too strict/loose

	mitralRefVelocityMode ibpointsonly; //off
    }

    // Required by your code path (no-op: adds nothing)
    bodyAddition
    {
        addModel           once;
        distributionCoeffs
        {
            addMode         boundBox;
            stlBaseSize     1e-5;
            addDomain       boundBox;
            boundBoxCoeffs
            {
                minBound (0 0 0);
                maxBound (0 0 0);
            }
        }
    }
}

// ************************************************************************* //
