tutorials/pimpleHFDIBFoam/Immersed_IB_Valves_in_Cube/Immersed-IB-Saddle-Valves-Mesh200k/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

rho             rho [1 -3 0 0 0 0 0] 1;
nu              nu  [0 2 -1 0 0 0 0] 1e-3;
// ************************************************************************* //
