tutorials/pimpleHFDIBFoam/Immersed_IB_Valves_in_Cube/Immersed-IB-Saddle-Valves-Mesh200k/Allrun-parallel
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#rm -rf 0

#cp -r 0.org 0

paraFoam -touch

runApplication blockMesh

runApplication decomposePar -force

application=`getApplication`


runParallel $application

runApplication reconstructParMesh -newTimes

runApplication reconstructPar


# ----------------------------------------------------------------- end-of-file
